In [17]:
import numpy as np
import pandas as pd 
import seaborn as sns 
import matplotlib as mpl

print(np.__version__)
print(pd.__version__)
print(sns.__version__)
print(mpl.__version__)

2.2.4
2.2.3
0.13.2
3.10.1

In [18]:
iris = sns.load_dataset("iris")
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [19]:
tips = sns.load_dataset("tips")
tips.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [20]:
iris.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [21]:
iris.shape

(150, 5)

In [22]:
tips.shape

(244, 7)

In [23]:
a = tips['day']
type(a)

pandas.core.series.Series

In [24]:
type(tips)

pandas.core.frame.DataFrame

In [25]:
tips['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [26]:
# 숫자열을 sort() 내림차순 정렬
# 상위 5개만 인덱싱
iris.nlargest(5, "sepal_length")

     sepal_length  sepal_width  petal_length  petal_width    species
131           7.9          3.8           6.4          2.0  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica

In [27]:
# tips의 평균 구하기
# 평균보다 큰 데이터만 조회 
mean_tip = tips['tip'].mean()
# numpy 문법 ==> a[a>12]
tips[tips['tip'] > mean_tip].head(1)

   total_bill  tip   sex smoker  day    time  size
2       21.01  3.5  Male     No  Sun  Dinner     3

In [28]:
tips[tips['tip'] > tips['tip'].mean()].head(1)

   total_bill  tip   sex smoker  day    time  size
2       21.01  3.5  Male     No  Sun  Dinner     3

In [29]:
tips['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [30]:
tips[tips['day'] == 'sat'].shape

# day sat

# time Dinner

(0, 7)

In [31]:
# day가 sat인 조회
# 인덱스 번호 0번째부터 재정렬
# head(1) 조회
tips[tips['day'] == 'sat'].reset_index(drop=True).head(1)

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

# loc vs iloc
- 코드 비교

In [32]:
# loc

In [33]:
# tips.loc[tips['day'] == 'sat']
# tips.loc[행, 열]
tips.loc[0, ['total_bill', 'tip', 'day']]

total_bill    16.99
tip            1.01
day             Sun
Name: 0, dtype: object

In [34]:
# iloc
tips.iloc[0:1, [0, 1, 4]]

   total_bill   tip  day
0       16.99  1.01  Sun

In [35]:
tips.loc[:, :]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [36]:
#total_bill 11이하인것만 조회
# tips.loc[:, :]
tips.loc[tips['total_bill'] <= 11, :].head(1)

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3

In [39]:
# time 이 Dinner인 것만 조회, loc 적용
tips.loc[tips['time'] == 'Dinner', :].head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [ ]:
tips.loc[(tips['time'] == 'Dinner') & (tips['total_bill'] <= 11), :]
# 조건식 2개
# # tips.loc[(조건식1) & (조건식2), :]

In [ ]:
# iris
# 품종이 virginica 이거나 sepal_length >= 5인 값만 가져오고
# 컬럼은 sepal_length, petal_length, species만 가져오세여
# loc 기반으로

#iris.loc[(조건식1) or (조건식2) , ['sepal_length', 'petal_length, 'species']]
#iris.loc[(조건식1) / (조건식2) , ['sepal-length', 'petal_length, 'species']]
iris.loc[(iris['species'] == 'virginica') ㅣ (iris['sepal_length']

In [ ]:
#time이 Dinner이면서 total_bill이 11이하인 것만 조회
result = tips.loc[tips['time'] == 'Dinner', :].head(1)
result.loc[result['total_bill'] <= 11, :]

In [ ]:



# tips.loc[tips['day'] == 'sat', ['total_bill', 'tip', 'day']].reset_index(drop=True)

In [ ]:
tips.loc[tips['day'] == 'sat']

#

In [2]:
import seaborn as sns 
import pandas as pd 

iris = sns.load_dataset("iris")
result = iris.loc[:, ['sepal_length', 'species']]

result.to_csv("dataset/iris_result.csv", index=False)